<?xml version="1.0" ?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="onnx::Cast_0" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1,772,1032"/>
			<rt_info>
				<attribute name="fused_names" value="/Cast, onnx::Cast_0" version="0"/>
				<attribute name="old_api_map_element_type" value="f16" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="/Cast_output_0,onnx::Cast_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_1567_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_1567" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="onnx::Conv_103_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="16, 1, 3, 3" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="onnx::Conv_103" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="onnx::Conv_103" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_103" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/model/model.0/model.0.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.0/model.0.0/Conv/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_37_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="290" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_37" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/model/model.0/model.0.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.0/model.0.0/Conv, Concat_36, Reshape_37" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.0/model.0.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_65_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="322" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_65" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_65" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/model/model.0/model.0.2/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/model/model.0/model.0.2/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.0/model.0.2/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/model/model.0/model.0.3/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="explicit" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.0/model.0.3/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>772</dim>
					<dim>1032</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/model/model.0/model.0.3/MaxPool_output_0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model.1.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="324" shape="32, 16, 3, 3" size="9216"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model.1.0.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="model.1.0.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model.1.0.weight" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model/model.1/model.1.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.1/model.1.0/Conv/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_88_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="9540" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_88" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model/model.1/model.1.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.1/model.1.0/Conv, Concat_87, Reshape_88" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.1/model.1.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_116_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="322" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_116" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_116" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/model/model.1/model.1.1/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/model/model.1/model.1.1/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.1/model.1.1/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model/model.1/model.1.2/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="explicit" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.1/model.1.2/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>386</dim>
					<dim>516</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/model/model.1/model.1.2/MaxPool_output_0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model.2.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="9604" shape="64, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model.2.0.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="model.2.0.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model.2.0.weight" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/model/model.2/model.2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.2/model.2.0/Conv/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_139_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="46468" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_139" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model/model.2/model.2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.2/model.2.0/Conv, Concat_138, Reshape_139" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.2/model.2.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_167_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="322" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_167" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_167" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model/model.2/model.2.1/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/model/model.2/model.2.1/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.2/model.2.1/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model/model.2/model.2.2/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="explicit" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.2/model.2.2/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>193</dim>
					<dim>258</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/model/model.2/model.2.2/MaxPool_output_0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model.3.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="46596" shape="128, 64, 3, 3" size="147456"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model.3.0.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="model.3.0.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model.3.0.weight" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model/model.3/model.3.0/Conv" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.3/model.3.0/Conv" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.3/model.3.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_172_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="322" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_172" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_172" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/model/model.3/model.3.1/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/model/model.3/model.3.1/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.3/model.3.1/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx::Conv_106_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="194052" shape="128, 128, 3, 3" size="294912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx::Conv_106" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="onnx::Conv_106" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="onnx::Conv_106" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model/model.4/model.4.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.4/model.4.0/Conv/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_194_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="488964" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_194" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model/model.4/model.4.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.4/model.4.0/Conv, Concat_193, Reshape_194" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.4/model.4.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_222_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="322" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_222" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_222" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/model/model.4/model.4.2/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/model/model.4/model.4.2/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.4/model.4.2/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model.5.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="489220" shape="128, 128, 3, 3" size="294912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model.5.0.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="model.5.0.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model.5.0.weight" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/model/model.5/model.5.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.5/model.5.0/Conv/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_244_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="784132" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_244" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model/model.5/model.5.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.5/model.5.0/Conv, Concat_243, Reshape_244" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.5/model.5.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_272_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="322" shape="1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_272" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="Constant_272" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model/model.5/model.5.1/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/model/model.5/model.5.1/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.5/model.5.1/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model.6.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="784388" shape="9, 128, 1, 1" size="2304"/>
			<output>
				<port id="0" precision="FP16">
					<dim>9</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model.6.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" value="model.6.weight" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>9</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model.6.weight" precision="FP32">
					<dim>9</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model/model.6/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.6/Conv/WithoutBiases" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>9</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_294_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="786692" shape="1, 9, 1, 1" size="18"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_294" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/model/model.6/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/model/model.6/Conv, Concat_293, Reshape_294" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/model/model.6/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_1459" type="Const" version="opset1">
			<data element_type="i64" offset="786710" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_1462" type="Const" version="opset1">
			<data element_type="i64" offset="786726" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_1465" type="Const" version="opset1">
			<data element_type="i64" offset="786742" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" ellipsis_mask="" end_mask="1, 0" new_axis_mask="" shrink_axis_mask=""/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="/Slice_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/Sigmoid" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/Sigmoid" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/Sigmoid_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/Mul, /Reciprocal" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/Mul_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_1568_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="786758" shape="1, 1, 96, 129" size="24768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_1568" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/Add_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_1569_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="811526" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_1569" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_1471" type="Const" version="opset1">
			<data element_type="i64" offset="786726" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_2" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_1474" type="Const" version="opset1">
			<data element_type="i64" offset="811528" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_2" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_1477" type="Const" version="opset1">
			<data element_type="i64" offset="786742" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_2" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/Slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" ellipsis_mask="" end_mask="1, 0" new_axis_mask="" shrink_axis_mask=""/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_2" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="/Slice_2_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/Sigmoid_1" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/Sigmoid_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/Sigmoid_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/Mul_1, /Reciprocal_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/Mul_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_1570_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="811544" shape="1, 1, 96, 129" size="24768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_1570" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/Add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/Add_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_1571_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="836312" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_1571" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_1483" type="Const" version="opset1">
			<data element_type="i64" offset="811528" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_3" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_1486" type="Const" version="opset1">
			<data element_type="i64" offset="836314" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_3" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_1489" type="Const" version="opset1">
			<data element_type="i64" offset="786742" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_3" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/Slice_3" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" ellipsis_mask="" end_mask="1, 0" new_axis_mask="" shrink_axis_mask=""/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_3" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="/Slice_3_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/Exp" type="Exp" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/Exp" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/Exp_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/Mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/Mul_2" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/Mul_2_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_1572_compressed" type="Const" version="opset1">
			<data element_type="f16" offset="836330" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_1572" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_1495" type="Const" version="opset1">
			<data element_type="i64" offset="836314" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_4" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_1498" type="Const" version="opset1">
			<data element_type="i64" offset="836332" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_4" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_1501" type="Const" version="opset1">
			<data element_type="i64" offset="786742" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_4" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/Slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" ellipsis_mask="" end_mask="1, 0" new_axis_mask="" shrink_axis_mask=""/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_4" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="/Slice_4_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/Exp_1" type="Exp" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="/Exp_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/Exp_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/Mul_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="/Mul_3" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/Mul_3_output_0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_1507" type="Const" version="opset1">
			<data element_type="i64" offset="836332" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_5" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_1510" type="Const" version="opset1">
			<data element_type="i64" offset="836348" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="/Slice_5" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_1513" type="Const" version="opset1">
